// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Ezt a szoftvert az indító partícióra kell telepíteni.";
"ERROR_INSTALL" = "Ez a partíció nem felelmeg a frissítés követelményeinek.";

"Newer_Package_Installed_message" = "Egy újabb verzió már telepítve van a Chameleon-ból.";
"Intel_Mac_message" = "Ez a szoftver nem telepíthető erre a számítógépre.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Telepítés típusa";
"InstallType_description" = "Válassz az új telepítés, vagy a jelenlegi frissítése között.";

"New_title" = "Új telepítés";
"New_description" = "Másolatot készít az 'Extra' mappáról (ha található ilyen a cél partíción), majd egy újat készít, a lenti beállításid alapján. Végül telepíti a Chameleon-t.";

"Upgrade_title" = "Frissítés";
"Upgrade_description" = "Kiegészíti az 'Extra' mappát (ha található ilyen a cél partíción), a lenti beállításaid alapján, majd telepíti a Chameleon-t. Az eredeti 'Extra' mappáról másolat készül.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon Rendszerbetöltő";
"Chameleon_description" = "A Chameleon működéséhez 3 fájl nélkülözhetetlen.
boot0 (Az MBR kódban a meghajtó elején), megkeresi és betölti a 'boot1'-et.
boot1 (A partíció elején a boot-sector-ban) megkeresi és betölti a 'boot2'-t.
boot2 (A partíció gyökér könyvtárában), betölti a kernelt és kiegészítőit.";

"Standard_title" = "Alapértelmezett";
"Standard_description" = "Telepíti a Chameleon a kijelölt partícióra,  a rendszeredtől függően boot0-t vagy boot0md-t, valamint megtartja a telepített Windows rendszereid indíthatóságát is.";

"EFI_title" = "EFI";
"EFI_description" = "A Chameleon-t a rejtett EFI partícióra telepíti, a rendszeredtől függően boot0-t vagy boot0md-t, valamint megtartja a telepített Windows rendszereid indíthatóságát is. (EFI partíció csak GUID lemezeken van.)";

"noboot_title" = "Nem telepíti a Chameleon-t.";
"noboot_description" = "Akkor hasznos ha csak '.kext'-eket szeretnél telepíteni.";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modulok";
"Module_description" = "A modulok segítségével újabb funkciókat adhatsz a Chameleon-hoz, amelyeket alapból nem tartalmaz.";

"AMDGraphicsEnabler_title" = "AMD GPU felismerés";
"AMDGraphicsEnabler_description" = "GraphicsEnabler ATI code ( > r784).
Ez az opció nem támogatja a régebbi ATI kártyákat. Ha a 'HD' kártyád nem működne, jelensd a következő oldalon:
http://forge.voodooprojects.org/p/chameleon/issues/
Ugyan ez vonatkozik az esetlegesen hiányzókra is.
Csak a ténylegesen működő kártyákat adjuk hozzá.";

"ATiGraphicsEnabler_title" = "ATi GPU felismerés";
"ATiGraphicsEnabler_description" = "GraphicsEnabler ATI code ( < r784).
Támogatás a régebbi ATI kártyákhoz...
Meklort munkája alapján.";

"IntelGraphicsEnabler_title" = "Intel GPU felismerés";
"IntelGraphicsEnabler_description" = "Néhány Intel videókártyát ismer fel. Nagyrészt a laptopokban lévőt";

"klibc_title" = "klibc";
"klibc_description" = "Egy alapértelmezett C futtatókörnyezetet biztosít más modulok számára.
Egyenlőre csak a uClibc++ modul használja.
Forrás: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Monitor felbontás";
"AutoReso_description" = "Kiolvassa az 'EDID' információkat az elsődleges monitorból.
Nem tartozik szervesen a Chameleon csomaghoz. Továbbá, a modul kijavítja az elérhető VESA módokat a korai Intel HD videokártyákon, hogy a megfelelő felbontással indíthasd a rendszered.";

"NVIDIAGraphicsEnabler_title" = "NVIDIA GPU felismerés";
"NVIDIAGraphicsEnabler_description" = "Az Nvidia GraphicsEnabler modulba protolva.
Ha a kártyád támogatott, de mégsem található a kódban, jelensd a következő oldalon:
http://forge.voodooprojects.org/p/chameleon/issues/
Csak a ténylegesen működő kártyákat adjuk hozzá.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Ez a modul egy minimális c++ futtatókörnyezetet tartalmaz, más modulokban történő felhasználásra. Önmagában nem befojásol semmit, csak lehetővé teszi a c++ nyelv használatát más modulokban.
*Az rtti és a kivételek letiltásra kerülnek.
Forrás: http://cxx.uclibc.org/
Függőségek: klibc";

"Keylayout_title" = "Billentyűzet kiosztás";
"Keylayout_description" = "Lehetővé teszi a billentyűzet kiosztás beállítását. Ez a modul, és a hozzátartozó kiosztások, alapértelmezetten telepítésre kerülnek.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Segédprogramok";
"Utility_description" = "Optional files to help setup";

"PrefPanel_title" = "Beállítások panel";
"PrefPanel_description" = "Telepíti a Chameleon panelt a rendszerbeállításokba.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Egy példa 'SMBIOS.plist' verziót másol a '/Extra/Configuration' mappába.";

"Documentation_title" = "Dokumentáció";
"Documentation_description" = "Dokumentáció a Chameleon kézi telepítéséhez és használatához.";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Beállítások";
"Options_description" = "Létrehozza az '/Extra/org.chameleon.Boot.plist'-et az alábbiakban megadott beállításokkal.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Eltünteti a Chameleon képernyőjéről a verziószámot.";

"GUI_title" = "GUI=No";
"GUI_description" = "Lecseréli az amúgy alapértelmezett grafikus Chameleon felületet a karakteres módra. (Fordító: Ajánlott beállítás, ha szeretnéd, hogy gyorsabban induljon a Chameleon.)";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Jelöld be, ha a témában lévő helyett, az eredeti almát szeretnéd látni a boot képernyőn, .";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "A Chameleon nem számol vissza, és nem indítja az alapértelmezett rendszert. Helyette azonnal az indítható rendszerek listáját mutatja";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Mindenféle információ vagy várakozás nélkül indítja a rendszert.";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Kiírja a partició és a felbontás infóit a GUI bal oldalára a Chameleon logó alá. Hasznos témák készítésénél.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Mikor a Chameleon befejezte a rendszer előtöltését (kernel, driverek, stb.) egy billentyű lenyomásáig megáll, ha ezt a beállítást bepipálod.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "A 32bites kernelt tölti be, az alapértelmezett 64bites helyett.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Kijavítja az EHCI jogokat. Hasznos, ha problémáid vannak az USB-vel, vagy az alvó móddal.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "A hálózati kártyát beépítettként segít betöltetni.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Engedélyezi a 'HPET'-et azokon az intel lapokon, amelyeken nincs lehetőség ezt bekapcsolni.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Ez a beállítás engedi, hogy betölthesd a hibás sleep képeket.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Letiltja az alapértelmezetten engedélyezett, 'újraindítás javítása' funkciót";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Újraindítja az UHCI kontollereket a Mac OS X indítása előtt. Hasznos, ha problémáid vannak az alvó móddal.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Kikapcsolja az alapértelmezett memória észlelést.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Csak Lion-hoz. Engedélyezi a gyorsítótárazott kernel betöltését. Nem tölti be a következő mappákat: /E/E és /S/L/E. CSAK akkor endegélyezd ha úgy érzed minden a helyén van!";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Engedélyezi a hibernációs fájl betöltését.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Új C-State _CST generálás a SystemIO regiszterek használatával, a fix hardveres helyett.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Eldobja az alaplap SSDT tábláját.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Lehetővé teszi a processzor C2-es módba való kapcsolását.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Lehetővé teszi a processzor C3-as módba való kapcsolását.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Lehetővé teszi a processzor C4-es módba való kapcsolását.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Automatikusan létrehozza a processzor C módjait (energiatakarékossági-lépcsők).";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Automatikusan létrehozza a processzor P módjait (sebesség-lépcsők).";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "A felbontást a következőre állítja: 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "A felbontást a következőre állítja: 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "A felbontást a következőre állítja: 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "A felbontást a következőre állítja: 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "A felbontást a következőre állítja: 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "A felbontást a következőre állítja: 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "A felbontást a következőre állítja: 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "A felbontást a következőre állítja: 1600x900x32";

"1600x1200x32_title" = "1600x1200x32";
"1600x1200x32_description" = "A felbontást a következőre állítja: 1600x1200x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "A felbontást a következőre állítja: 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "A felbontást a következőre állítja: 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "A felbontást a következőre állítja: 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Lehetővé teszi az NVIDIA alapú videókártyák automatikus felismerését.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Engedélyezi a UseAtiROM opciót.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Engedélyezi a UseNvidiaROM opciót.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Engedélyezi a VBIOS opciót.";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "A rendszert az alma logó helyett, karakteres módban indítja így figyelemmel kísérheted a rendszer betöltődését. Hibaelhárításnál hasznos.";

"Singleusermode_title" = "Single User mód";
"Singleusermode_description" = "A rendszert parancssoros módban indítja.";

"Ignorecaches_title" = "Gyorsítótárak kihagyása";
"Ignorecaches_description" = "Ez egy nem mindennaposan használandó mód. A rendszer az összes rendszerfájlt úrjatölti. Akkor használd ha a géped nem indulna megfelelően.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Orvosolja néhány gépen a 'PCI configuration begin'-nél történő lefagyást. 0x2000 is the kIOPCIConfiguratorPFM64 flag, as seen in the IOPCIFamily source code.";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "Orvosolja néhány gépen a 'PCI configuration begin'-nél történő lefagyást. 0x3000 is the kIOPCIConfiguratorPFM64 flag, as seen in the IOPCIFamily source code.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Csak Lion-hoz. Kikapcsolja a 'low power wake' funkciót, ami néha üres, vagy fekete képernyőt okoz alvó módból való ébresztés után.";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "Német Mac kiosztás";
"mac-de_description" = "Használd ezt a kiosztást a német Mac billentyűzetekhez.";

"mac-es_title" = "Spanyol Mac kiosztás";
"mac-es_description" = "Használd ezt a kiosztást a spanyol Mac billentyűzetekhez.";

"mac-fr_title" = "Francia Mac kiosztás";
"mac-fr_description" = "Használd ezt a kiosztást a francia Mac billentyűzetekhez.";

"mac-it_title" = "Olasz Mac kiosztás";
"mac-it_description" = "Használd ezt a kiosztást a olasz Mac billentyűzetekhez.";

"mac-se_title" = "Svéd Mac kiosztás";
"mac-se_description" = "Használd ezt a kiosztást a svéd Mac billentyűzetekhez.";

"mac-pt_title" = "Portugál Mac kiosztás";
"mac-pt_description" = "Használd ezt a kiosztást a portugál Mac billentyűzetekhez.";

"pc-de_title" = "Német PC kiosztás";
"pc-de_description" = "Használd ezt a kiosztást a német PC billentyűzetekhez.";

"pc-es_title" = "Spanyol PC kiosztás";
"pc-es_description" = "Használd ezt a kiosztást a spanyol PC billentyűzetekhez.";

"pc-fr_title" = "Francia PC kiosztás";
"pc-fr_description" = "Használd ezt a kiosztást a francia PC billentyűzetekhez.";

"pc-it_title" = "Olasz PC kiosztás";
"pc-it_description" = "Használd ezt a kiosztást a olasz PC billentyűzetekhez.";

"pc-se_title" = "Svéd PC kiosztás";
"pc-se_description" = "Használd ezt a kiosztást a svéd PC billentyűzetekhez.";

"pc-pt_title" = "Portugál PC kiosztás";
"pc-pt_description" = "Használd ezt a kiosztást a portugál PC billentyűzetekhez.";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "A smaller simple version of the new default theme used when building a version of Chameleon which requires an embedded theme.";

"Legacy_title" = "Örökölt";
"Legacy_description" = "Chameleon's eredeti témája a v2.0 RC1 verzióból";

"Default_title" = "Alapértelmezett";
"Default_description" = "Az alapértelmezett téma a v2.0 RC5 verzióhoz";

"Bullet_title" = "Bullet";
"Bullet_description" = "Egy egyszerű téma NoSmokingBandit-tól";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Vezérlés";
"Control_description" = "Beállítások a Chameleon vezerléséhez..";

// General
"General_title" = "Általános beállítások";
"General_description" = "Válaszd ki a szükségek alapbeállításokat.";

// KernelFlags
"KernelFlags_title" = "Kernel paraméterek";
"Kernel_description" = "Válaszd ki milyen paraméterekkel induljon a kernel.";

// PowerManagement
"PowerManagement_title" = "Energiagazdálkodás";
"PowerManagement_description" = "Beállítások az energiagazdálkodáshoz és a sebesség-lépcsőkhöz.";

// Resolution
"Resolution_title" = "Felbontás";
"Resolution_description" = "Jelölj ki egy a monitorodnak leginkább megfelelő felbontást.";

// Video
"Video_title" = "Video";
"Video_description" = "Videóhoz kapcsolódó beállítások.";

// Keymaps
"Keymaps_title" = "Billentyűzet kiosztás";
"Keymaps_description" = "Válassz ki egy kiosztást a használatához. Ez egyúttal telepíti a billentyűzet kiosztás modult is.";

// Themes
"Themes_title" = "Témák";
"Themes_description" = "Az alapértelmezett témákat itt találod, a többit a 
http://forum.voodooprojects.org/index.php/board,7.0.html címen érheted el.";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Ne válassz felbontást.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Ne válassz billentyűzet kiosztást.";
